Revit 2026 API

# FabricationConfigurationInfoGetProfiles Method

---

Return the profiles in the fabrication configuration.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<string> GetProfiles()
```
```vb
Public Function GetProfiles As IList(Of String)
```
```cpp
public:
IList<String^>^ GetProfiles()
```
```fsharp
member GetProfiles : unit -> IList<string>
```

#### Return Value

IListString

The global profile name is empty, and is not returned here.

#### Reference

FabricationConfigurationInfo Class

Autodesk.Revit.DB Namespace